[Killed] StringLiteral
Projects/stryker-test/src/formatters.ts:6:3
 export type Formatter<T> = (t: T) => string
 
 export const toIsAdultString: Formatter<Person> = person =>
-  `${person.name} ${isAdult(person) ? 'is' : 'is not'} an adult.`
+  ""
 
