[Killed] EqualityOperator
Projects/stryker-test/src/person.ts:6:55
   age: number
 }
 
-export const isAdult = (person: Person) => person.age >= 18
+export const isAdult = (person: Person) => person.age > 18
 
 export const toPerson = (name: string, age: number) => ({ name, age })

[Killed] EqualityOperator
Projects/stryker-test/src/person.ts:6:55
   age: number
 }
 
-export const isAdult = (person: Person) => person.age >= 18
+export const isAdult = (person: Person) => person.age < 18
 
 export const toPerson = (name: string, age: number) => ({ name, age })

[Killed] ArrowFunction
Projects/stryker-test/src/person.ts:8:25
 
 export const isAdult = (person: Person) => person.age >= 18
 
-export const toPerson = (name: string, age: number) => ({ name, age })
+export const toPerson = () => undefined
 
