[Survived] ArrowFunction
Projects/stryker-test/src/printer.ts:3:56
 import { Formatter } from './formatters'
 
-export const printer = <T>(formatter: Formatter<T>) => (value: T) =>
-  console.log(formatter(value))
+export const printer = <T>(formatter: Formatter<T>) => () => undefined
 

[Survived] ArrowFunction
Projects/stryker-test/src/printer.ts:3:24
 import { Formatter } from './formatters'
 
-export const printer = <T>(formatter: Formatter<T>) => (value: T) =>
-  console.log(formatter(value))
+export const printer = () => undefined
 
